laRhea BL
                          laRhea BL
Viteză amestec            laRhea V+
                          pune
paharul                        se activează...
te rog așteaptă     preselecție
-   Zahăr    +          pune
paharul                        retrage paharul
Te rog              se prepară
băutura nr. §1           Se prepară
§1                       introduceți
suma exactă             verificare
grup cafea               Programare
OK                       Eroare la
programare                1= CHEIE --->VMC
2= VMC --->CHEIE   Programare
date EAROM               Programare
RHEA FLASH------         rezervă produs
§1                   SPĂLARE FILTRU
APĂ  10=START        Aparat
funcțional                   Service
Card                        Indisponibil
                       resetare zaț
cafea =RESET           resetare zaț
cafea = P1              
                                  Credit:
§1                          Defect momentan
filtru apă          service
curăță grup                 preț:  §1
                          Defect momentan
zaț cafea           lipsă produs
                       încarcă apa
așteaptă                așteaptă
                           așteaptă
temperatură                Nefuncțional
OPRIT §1 §2            automat oprit
§1:§2                 ................
start la:§1:§2     TESTARE
                            ia o pauză
și relaxează-te          Lapte
Proaspăt                      mesaj 3
programabil                 profită de pauză
                   Întotdeauna
la dispoziția ta        introdu monedele
                   t. inst.     §1
----------------    t.c §1t.s§2
t.h §3                  Cititor card
Neconectat             AUDIT DATE
TE ROG AȘTEAPTĂ          C A R A F Ă
                        rheavendors
                        Pune
paharul                        fără selecții
Lapte P. OFF§1        HAPPY
HOUR                          FREE VEND
§1                        Lipsă cafeaboabe
OFF §1             mes 48
                             DEFECT MOMENTAN
Lipsă apă           Umple cu apă și
apasă buton -1-     Fază golire
hidrodinamică           clătire
automată aburi              SERVICE
                            Eroare pe cheie
cod  §1             1-4=Mix5=LapteMd
7=Rș8=BC9=Detar    1-4=Clătire
7=Rș 8=BC9=Detar        1-4=Clăt 5=Lapte
7=râșniță 8=BC     1-4=Clătire
8=BC                    1-4=Clătire
                        Clătire §1
§2                       Cit.card RFID
conectat              Bună    §1
§2-§3-§4§5§6:§7          Introduceți
suma exactă             Schimbă
Filtru apă                  Curăță grup
cafea                   golește
zaț cafea                   SETARE PRODUS
---- OK ----          INSTALARE
                          final
instalare                     credit = 0
                         prezintă
card                       SELECȚIE CARD
                      rezervă produs
UMPLE CAFEA          Indisponibil
§1                     -  ZAHAR   +
                       selectează
produs                   modul cu ușă
versiune  §1           modul espresso
versiune  §1         Modul de lapte
versiune  §1         Clăt. periodică
în §1 secunde        
OFF §1  §2                        Te rog
ia paharul                   asteaptă încărc.
boiler abur        client invalid
cod card             aparat invalid
cod card             selecție
norocoasă                  JETON
                              temp.abur te rog
așteaptă           Preț:   §1
Credit:§2                Prima cafea
în curs                 golire
zaț cafea                    scoate tavă
picurare                introdu
tavă picurare               Spălare aburi
10=START              pune detergent
10=START             umplere apă...
conduc.=§1 uS        umple apă
10=START                  spăl. apă caldă
10=START            Activare modul
lapte...             Recipient lapte
gol                 S T O P
                            Card RFID
Blocat                    Curăță
Modul Lapte                  Curăță cu
deterg. 10=START          rundă #§1
Test Ciclic               Test Ciclic
Oprit!!!                clătește cu apă
rece    10=START    FINAL Spălare
cu Detergent          FINAL
spălare cu aburi              Așteaptă spălare
modul lapte        Pune pahar
te rog                   setare râșniță
te rog așteaptă      §1
APĂ CALDĂ                        Atenție nivel
scăzut produse         
                                  Preluare cafea
Apasă But. PROG       
resetare autom.                   Final
dezinstalare                  Rez. Fin.:§1
APASĂ BUT <PROG>       Oră spălare
Cappucc. actual.        TEST ÎN CURS
                       confirmă parțial
reset apasă P10    Începere Test
4=startPROG=stop      TEST MOTOR - §1
st §2  dr §3        TEST-§1 Tp: §2
sus§3jos§4           Rezultat Final
TEST - §1            Sistem oprit
Reporniți-l!           Golire recipient
reziduu lichid     Introdu recip.
reziduu lichid       clătire §1 §2
...uS=§3              Ați efectuat
verif.?>START/10       Clean.Deter.type
10=Tab 12=Liquid   verifică lapte
                     Verif. Detergent
din mix apă        Spăl Mod.Lapte:
verif.deter.§1      Spăl. §1 §2
...uS=§3                Dizolvare
Deterg. §1 §2             Pune tub lapte
10:acum 9:nu         Pune Tub/Umple
Lapte10:acum9:nu     verif. prezență
lapte               verif. calit.
lapte                 verif. lapte și
spală               Gest. rhMM1.v+ ?
B1=Activ. B2=nu    Spăl. rhMM1.v+
Timp§1:§2Ok=P1       Spăl.ModulLapte:
deter. insuf §1    verif. temp.
recip.lapte rece       Disponibil
                         Închide Cafea
APASĂ BUT <PROG>      Deschide Cafea
APASĂ BUT <PROG>     1/13 Curăță Râșn
1=Râșn1; 2=Râșn2   2/13 G§1 Închide
capac.  10=ok      3/13 Scoate grup
&recip.caf.10=ok   4/13 Inst. disp.
curățare 10=ok     5/13 Curăță
râșniță 10=start        Ciclul §1 din §2
                   6/13 Rep. Spăl.
10=Da; altele=NU    7/13 Ref. dispoz
curățare 10=ok     8/13 Pune înapoi
recip caf. 10=ok   9/13Desch. capac
recip. 10=ok       10/13 Râșniță
cafea. 10=Start       Ciclu §1 din §2
timeout §3 sec      11/13 Rep. Proc.
10=DA; altele=NU   12/13Pune înapoi
Grup.  10=ok       13/13 Cafea?
10=Da; altele=NU       Preparare
ESPRESSO                  Urmează
întreț. progr.              Efectuați
întreținere               Introdu greutate
1=Salvare §1       Te rog
retrage paharul              Defect momentan
Lipsă apă           Pune paharul
și închide ușiță       scoate tava de
picurare             introdu
tava de picurare            Te rog închide
ușiță                Te rog curăță
Modul Lapte           pune paharul
                       introdu
suma exactă                 verifică
grup cafea                 service
curăță grup                 Pornește la:
§1:§2                  TEST VEND
                          ia o pauză
și relaxează-te          Lapte
Proaspăt                      mesaj 3
programabil                 profită de pauză
                   Întotdeauna
la dispoziția ta        introdu monedele
                   Curăță grup
cafea                   golește
zaț cafea                   FINAL PROGRAMARE
te rog așteaptă    cod acces
BLOCAT                    dezinstalare
în curs...              
                                  CALIBRAREA NU
E POSIBILĂ            Scoate Grup
Apasă but. PROG         Pune înapoi Grup
Apasă but. PROG    Desch rob.boiler
10=start           APASĂ TASTĂ
>PROG<                  final dezinstal.
înch rob. boiler   Alimentare apă
conect.?Start=10     tavă picurare
în int.?10=START      tavă picurare
în int.?10=START      scoate zaț
cafea 10=START           Tavă picurare
goală? Start=10       ÎNREGISTRARE
nefuncțională          ÎNREGISTRARE
nefuncțională          PROGRAMARE-----
----------------    Preselecție
neutilizată             PRODUS  §1
0=blocat §2.§3           timp cafea
râșniță §1 §2.§3         timp cafea
râșniță §1.§2            Intr.Greut §1
1=Salv. 2=Repetă      Introdu ML apă
1=Salv 2=rep§1       Golirecarafătest
Test:  1=ok 2=nu   UmplH2O recip.FM
t.tub 1=ok 2=nu    Conf. acțiune
10=DA      9=NU       1-4=Mix5=LapteMd
8=BC 9=Detar.      1-4=Clătire
8=BC 9=Detar.           1-4=Clăt.5=Lapte
8=BC               1-4=Clătire
7=grinder 8=BC          1-4=Mx M:5=C 6=D
7=Gr 8=BC 9=Desc   1-4=Clăt.5=Lapte
6=DeM 8=BC 9=Des   1-4=Clăt.5=Lapte
6=D.M 7=Gr. 8=BC   1-4=Clăt.5=Lapte
6=Desc.Milk 8=BC   ECON. ENERG.
                       Credit:
Card de credit              prezentați
cardul                   Calib. râșniță
necesară             Refill   cups
                      Use own cups
                       